// 1) კომენტარებით ახსენით დღევანდელი ნასწავლი მონაცემთა ტიპები და გვერდით მიუწერეთ ახსნაც 

/* string - ბრჭყალებში მოქცეული მნიშვნელობა
integer - მთელი და ათწილად რიცხვი
boolean - True და False
null - უცნობი მნიშვნელობა 
undefined - განუსაზღვრელი მნიშვნელობა
Nan - not a number
object - dictionnarys მსგავსი მნიშნელობა რომელიც  შედგება key და value წყვილისგან*/


// 2) დააკავშირეთ js html ფაილთან, შემდეგ საიტზე დაამატეთ ერთი button, ღილაკზე დაჭერის შემდეგ, კონსოლში უნდა შესრულდეს მათემატიკური მიმატების ოპერაცია
// hw is in html file

// 3) კომენტარის სახით ახსენით თუ რა არის კონსოლი და რაში გვეხმარება, ასევე ახსენით თუ რა არის console.log() და რატომ ვიყენებთ მას

// კონსოლი არის სივრცე სადაც არის ჩვენი კოდის შედეგი,კოდი ეშვება ბრაუზერში,ზუსტად კონსოლ განყოფილებაში, ხოლორ console.log(); აკეთებს იგივე პრინტ ფუნქციას,რომ ჩვენი კოდის შედეგი ვიხილოთ კონსოლში, .log(); მეთოდის მიერ


// 4) external ჯავასკრიპტის ფაილში გააკეთეთ თითო მაგალითი თითო მათემატიკურ ოპერაციაზე და დაბეჭდეთ ყველაფერი console ში

console.log(1 + 1);
console.log(1 - 1);
console.log(1 / 1);
console.log(1 % 1);
console.log(1 * 1);

// 5) საიტზე დაამატეთ ერთი button, მასზე დაკლიკების შემდეგ, საიტზე უნდა გამოვიდეს თქვენი სახელი alert ფანჯარაში

// 5 hw is in html file

// 6) external ჯავასკრიპტში მომხმარებელს მოსთხოვე რომ შემოიტანოს თავისი საყვარელი რიცხვი
const number = prompt('enter your fav number gvelo: ')
console.log(number);