// 1) შექმენით ლუპი და გამოიტანეთ 10 დან 100 ის შათვლით ყველა მეხუტე ელემენტი
for(let i = 10; i < 105; i+=5){
    console.log(i)
}
//  2) შექმენით 8 ელემენტიანი სია. ლუპის გამოყენებით დაიწყეთ მენულე ინდექსიდან და წამოიღეთ ყოველი მეორე ელემენტი
let list = [1,2,3,4,5,6,7,8]
for(let l = 0; l <= list.length; l+=2){
    console.log(list[l])
}
//  3) შექმენით 2 3-3 ელემენტიანი სია. ლუპის გამოყენებით დააბრუნეთ ის რიცხვები რომელიც ორივე სიაში გვხვდება
let list1 = [14,9,4]
let list2 = [10,23,4]
for(let k = 0; k < list1.length; k++){
    for(k1 = 0; k1 < list2.length; k1++){
        if(list1[k] == list2[k1]){
            console.log("they both have the same value", k)
        }
    }
}