// 1) ახსენით განსხვავება მკაცრ და არამკაცრ ტოლობას შორის და ასევე გააკეთეთ თითო მაგალითი ორივეზე

/* 
=== -> არის მკაცრი, ამოწმებს მნიშვნელობას მკაცრად მაგალითად "5" == 5 -> false
== არ ამოწმებს მკაცრად,უბრალოდ ამოწმებს თუ შიგთავშ იგივეა "5" == 5 -> true(რადგან ორივეგან 5 წერია)

*/

// 2) შექმენით ერთი ცვლადი სადაც Prompt ით შემოიტანთ რიცხვს, თქვენი მიზანია რომ შეამოწმოთ თუ არის მომხმარებელი 18 წლის მაშინ კონსოლში გამოიტანეთ რომ მას მართვის მოწმობის აღება შეუძლია, სხვა შემთხვევაში, უთხარით რომ დაელოდოს 18 წლის გახდომას

let num = prompt("enter your num: ")
if (num < 18){
    console.log("shegidzlia pravis ageba")
}else {
    console.log("daelode gazrdas")
}

// 3)  დაწერე პროგრამა, რომელიც მომხმარებლისგან შეიტანს სტუდენტის მიღებულ ქულას (0-დან 100-მდე) და if-else პირობით გამოიტანს შესაბამის ნიშანს შემდეგი წესით:

// ქულა        ნიშანი
// 90 – 100      A
// 80 – 89       B
// 70 – 79       C
// 60 – 69       D
// 0 – 59        F

let score = prompt("enter your score: ")
if (score > 90){
    console.log("A")
} else if (score > 80) {
    console.log("B")
} else if (score > 70) {
    console.log("C")
} else if (score > 60) {
    console.log("D")
} else {
    console.log("F")
}



