// 1) ახსენით თუ რა განსხვავებაა ამ 3 keywordს შორის: var, let, const

// let - ყოველთვის შეგვიძლია შევცვალოთ და შეგვიძლია გამოვაცხადოთ ყველგან
// const - ვრცლად(constant) ნიშნავს მუდმივს,ანუ ცვლადის მნიშვნელობას ვეღარ შევცვლით.
// var - მოდის სიტყვიდან variable (ცვლადი). ხშირად იწვევს დაბნეულობას, ამიტომ თანამედროვე კოდში აღარ გამოიყენება.


// 2) კონსოლში გამოიტანეთ ათწილადი რიცხვი: 5.6678667, და:

// დაამრგვალეთ უმცირეს მთელ რიცხვამდე
// ყველაზე მაღალ მთელ რიცხვამდე

console.log(math.floor(5.6678667))
console.log(math.ceil(5.6678667))


// 3) გააკეთეთ თითო-თითო მაგალითი min და max სზე

console.log(math.max(1,2,3,4,5))
console.log(math.max(3,932,34,42,100))
console.log(math.max(111,23,18,4,3))

console.log(math.min(1,2,3,4,5))
console.log(math.min(3,932,34,42,100))
console.log(math.min(111,23,18,4,3))