#1)შექმენით ფუნქცია სახელად add რომელსაც გადაეცემა ორი არგუმენტი num1 და num2 ,შემდეგ ფუნქციაში გამოითვალეთ მათი ჯამი და დაპრინტეთ არ დაგავიწყდეთ ფუნქციების გამოძახება და არგუმენტების გადაცემა

def add(num1, num2):
    result = num1 + num2
    print(result)
add(5, 10) 
add(20, 30) 

#2) შექმენით ფუნქცია სახელად substract რომელსაც გადაეცემა ორი არგუმენტი num1 და num2,შემდეგ ფუნქციაში გამოთვალეთ მათი სხვაობა და დაპრინტეთ ის ,არ დაგავიწყდეთ ფუნქციების გამოძახება და არგუმენტების გადაცემა

def substract(num1, num2):
    result = num1 - num2
    print(result)

substract(15, 5)  
substract(50, 20) 


