// 1) მომხმარებელს შეჰყავს ქულა (0–100).

// თუ ქულა 50-ზე მეტია და 100-ზე ნაკლები ან ტოლია, დაბეჭდე "ჩააბარე"

// სხვა შემთხვევაში დაბეჭდე "ვერ ჩააბარე"

let UserScore = parseInt(prompt("enter your score: "))
if (UserScore > 50 && UserScore <= 100){
    console.log("ჩააბარა")
}else {
    console.log("ვერ ჩააბარა")
}

// 2) მომხმარებელს შემოატანინეთ ორი მნიშვნელობა:
//   ასაკი
//   აქვს თუ არა სტუდენტური ბილეთი (true/false)

let age = parseInt(prompt("enter your age; "));
let card = prompt("do you have a school card(true or false); ") 
let card2 = card2 === "true"
  
//   თუ მომხმარებელი 18 წელზე მეტია ან აქვს სტუდენტური ბილეთი, დაბეჭდე "შესვლა ნებადართულია"
//   სხვა შემთხვევაში — "შესვლა აკრძალულია"
if(age > 18 && card2){
    console.log("შესვლა ნებადართულია")
}else {
    console.log("შესვლა აკრძალულია")
}



// 3) მომხმარებელს შემოატანინე:
// პაროლი
let password = prompt('enter your password: ')
let AnotherPassword = "anazalatoi123"
let block = prompt('enter here if your login in blocked(true or false); ')
let block2 = block === 'true'

// დაბლოკილია თუ არა ანგარიში (true/false)

// თუ პაროლი სწორია და ანგარიში არ არის დაბლოკილი, დაბეჭდე "წარმატებით შეხვედით სისტემაში"
// სხვა შემთხვევაში დაბეჭდე "შესვლა ვერ მოხერხდა"

if (password === AnotherPassword && block1){
    console.log("წარმატებით შეხვედით სისტემაში")
}else {
    console.log("შესვლა ვერ მოხერხდა")
}

// 4)  მომხმარებელს შემოატანინეთ ტემპერატურა ცელსიუსში.
// თუ ტემპერატურა 0-ზე ნაკლებია → დაპრინტეთ “Cold ❄️”,
// თუ 0–30 შორისაა → დაპრინტეთ “Normal 🌤️”,
// თუ 30-ზე მეტია → დაპრინტეთ “Hot ☀️”.

let gradusi = parseInt(prompt("enter your gradusi: "))
if (gradusi < 0){
    console.log('Cold')
}else if (gradusi < 30){
    console.log('Normal')
}else{
    console.log("Hot")
}