// 1. კომენტარის სახით ახსენით რა არის global scope / block scope / function scope და თითოეულზე მოიყვანეთ მაგალაითები.
// პასუხი:
//global scope ის მეშვეობით შეგვიძლია ნებისმიერი ხაზიდან გამოვიძახოთ და მივიღოთ შედეგი

// 2. შექმენი ცვლადი `x` გლობალურ scope-ში და მიანიჭე მნიშვნელობა 10. შემდეგ ფუნქციის შიგნით შექმენი იგივე სახელის ცვლადი `x` მნიშვნელობით 20 და გამოიტანე ორივე console-ში. რა განსხვავებაა?

// const x = 10; --> არის გლობალ სკოუპი

//function x(){ --> არის ფუნქციის სკოუპი
    // const x = 10 
// }

// 3. დაწერე ფუნქცია, სადაც `let`-ით გამოცხადებული ცვლადი არსებობს `if` ბლოკის შიგნით. სცადე ამ ცვლადის გამოყენება ბლოკის გარეთ.
function func(){
    if(true){
        let variable = "Nia"
        return variable
    }else {
        return "No"
    }
}
console.log(func())

// 4. შექმენი `var` ცვლადი ფუნქციის შიგნით და სცადე მისი გამოყენება ფუნქციის გარეთ. რა მოხდება?
function WithVar(){
    var vari = "Nia in var keyword"
    return vari
}
console.log(WithVar()) //პასუხი: არაფერიც არამოხდა ჩვეულებრივ გამოვიდა ჭჭჭჭჭ

// 5. დაწერე for ციკლი `let i = 0`-ით. ციკლის დასრულების შემდეგ სცადე `i`-ის დაბეჭდვა console-ში.

for(let i = 0; i <= 10; i++){
    console.log(i);
}